Revit 2027 API
BuiltInFailures.FamilyFailures.UnexpectedFamilyChangeResultsError Property
 Changing the family for a MEP fitting might cause unexpected results.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnexpectedFamilyChangeResultsError { get; }
Public Shared ReadOnly Property UnexpectedFamilyChangeResultsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnexpectedFamilyChangeResultsError {
	FailureDefinitionId^ get ();
}
static member UnexpectedFamilyChangeResultsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace